una1veritas/Workspace/ARM_STM32/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam7xc512.h
/* -------- TCB_BCR : (TCB Offset: 0xc0) TC Block Control Register -------- */
#define AT91C_TCB_SYNC        ((unsigned int) 0x1 <<  0) /* (TCB) Synchro Command*/
/* -------- TCB_BMR : (TCB Offset: 0xc4) TC Block Mode Register -------- */
#define AT91C_TCB_TC0XC0S     ((unsigned int) 0x3 <<  0) /* (TCB) External Clock Signal 0 Selection*/
#define 	AT91C_TCB_TC0XC0S_TCLK0                ((unsigned int) 0x0) /* (TCB) TCLK0 connected to XC0*/
#define 	AT91C_TCB_TC0XC0S_NONE                 ((unsigned int) 0x1) /* (TCB) None signal connected to XC0*/
#define 	AT91C_TCB_TC0XC0S_TIOA1                ((unsigned int) 0x2) /* (TCB) TIOA1 connected to XC0*/
#define 	AT91C_TCB_TC0XC0S_TIOA2                ((unsigned int) 0x3) /* (TCB) TIOA2 connected to XC0*/
#define AT91C_TCB_TC1XC1S     ((unsigned int) 0x3 <<  2) /* (TCB) External Clock Signal 1 Selection*/
#define 	AT91C_TCB_TC1XC1S_TCLK1                ((unsigned int) 0x0 <<  2) /* (TCB) TCLK1 connected to XC1*/
#define 	AT91C_TCB_TC1XC1S_NONE                 ((unsigned int) 0x1 <<  2) /* (TCB) None signal connected to XC1*/
#define 	AT91C_TCB_TC1XC1S_TIOA0                ((unsigned int) 0x2 <<  2) /* (TCB) TIOA0 connected to XC1*/
#define 	AT91C_TCB_TC1XC1S_TIOA2                ((unsigned int) 0x3 <<  2) /* (TCB) TIOA2 connected to XC1*/
#define AT91C_TCB_TC2XC2S     ((unsigned int) 0x3 <<  4) /* (TCB) External Clock Signal 2 Selection*/
#define 	AT91C_TCB_TC2XC2S_TCLK2                ((unsigned int) 0x0 <<  4) /* (TCB) TCLK2 connected to XC2*/
#define 	AT91C_TCB_TC2XC2S_NONE                 ((unsigned int) 0x1 <<  4) /* (TCB) None signal connected to XC2*/
#define 	AT91C_TCB_TC2XC2S_TIOA0                ((unsigned int) 0x2 <<  4) /* (TCB) TIOA0 connected to XC2*/
#define 	AT91C_TCB_TC2XC2S_TIOA1                ((unsigned int) 0x3 <<  4) /* (TCB) TIOA2 connected to XC2*/

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Control Area Network MailBox Interface*/
/* ******************************************************************************/
typedef struct _AT91S_CAN_MB {
	AT91_REG	 CAN_MB_MMR; 	/* MailBox Mode Register*/
	AT91_REG	 CAN_MB_MAM; 	/* MailBox Acceptance Mask Register*/
	AT91_REG	 CAN_MB_MID; 	/* MailBox ID Register*/
	AT91_REG	 CAN_MB_MFID; 	/* MailBox Family ID Register*/
	AT91_REG	 CAN_MB_MSR; 	/* MailBox Status Register*/
	AT91_REG	 CAN_MB_MDL; 	/* MailBox Data Low Register*/
	AT91_REG	 CAN_MB_MDH; 	/* MailBox Data High Register*/
	AT91_REG	 CAN_MB_MCR; 	/* MailBox Control Register*/
} AT91S_CAN_MB, *AT91PS_CAN_MB;

/* -------- CAN_MMR : (CAN_MB Offset: 0x0) CAN Message Mode Register -------- */
#define AT91C_CAN_MTIMEMARK   ((unsigned int) 0xFFFF <<  0) /* (CAN_MB) Mailbox Timemark*/
#define AT91C_CAN_PRIOR       ((unsigned int) 0xF << 16) /* (CAN_MB) Mailbox Priority*/
#define AT91C_CAN_MOT         ((unsigned int) 0x7 << 24) /* (CAN_MB) Mailbox Object Type*/
#define 	AT91C_CAN_MOT_DIS                  ((unsigned int) 0x0 << 24) /* (CAN_MB) */
#define 	AT91C_CAN_MOT_RX                   ((unsigned int) 0x1 << 24) /* (CAN_MB) */
#define 	AT91C_CAN_MOT_RXOVERWRITE          ((unsigned int) 0x2 << 24) /* (CAN_MB) */
#define 	AT91C_CAN_MOT_TX                   ((unsigned int) 0x3 << 24) /* (CAN_MB) */
#define 	AT91C_CAN_MOT_CONSUMER             ((unsigned int) 0x4 << 24) /* (CAN_MB) */
#define 	AT91C_CAN_MOT_PRODUCER             ((unsigned int) 0x5 << 24) /* (CAN_MB) */
/* -------- CAN_MAM : (CAN_MB Offset: 0x4) CAN Message Acceptance Mask Register -------- */
#define AT91C_CAN_MIDvB       ((unsigned int) 0x3FFFF <<  0) /* (CAN_MB) Complementary bits for identifier in extended mode*/
#define AT91C_CAN_MIDvA       ((unsigned int) 0x7FF << 18) /* (CAN_MB) Identifier for standard frame mode*/
#define AT91C_CAN_MIDE        ((unsigned int) 0x1 << 29) /* (CAN_MB) Identifier Version*/
/* -------- CAN_MID : (CAN_MB Offset: 0x8) CAN Message ID Register -------- */
/* -------- CAN_MFID : (CAN_MB Offset: 0xc) CAN Message Family ID Register -------- */
/* -------- CAN_MSR : (CAN_MB Offset: 0x10) CAN Message Status Register -------- */
#define AT91C_CAN_MTIMESTAMP  ((unsigned int) 0xFFFF <<  0) /* (CAN_MB) Timer Value*/
#define AT91C_CAN_MDLC        ((unsigned int) 0xF << 16) /* (CAN_MB) Mailbox Data Length Code*/
#define AT91C_CAN_MRTR        ((unsigned int) 0x1 << 20) /* (CAN_MB) Mailbox Remote Transmission Request*/
#define AT91C_CAN_MABT        ((unsigned int) 0x1 << 22) /* (CAN_MB) Mailbox Message Abort*/
#define AT91C_CAN_MRDY        ((unsigned int) 0x1 << 23) /* (CAN_MB) Mailbox Ready*/
#define AT91C_CAN_MMI         ((unsigned int) 0x1 << 24) /* (CAN_MB) Mailbox Message Ignored*/
/* -------- CAN_MDL : (CAN_MB Offset: 0x14) CAN Message Data Low Register -------- */
/* -------- CAN_MDH : (CAN_MB Offset: 0x18) CAN Message Data High Register -------- */
/* -------- CAN_MCR : (CAN_MB Offset: 0x1c) CAN Message Control Register -------- */
#define AT91C_CAN_MACR        ((unsigned int) 0x1 << 22) /* (CAN_MB) Abort Request for Mailbox*/
#define AT91C_CAN_MTCR        ((unsigned int) 0x1 << 23) /* (CAN_MB) Mailbox Transfer Command*/

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Control Area Network Interface*/
/* ******************************************************************************/
typedef struct _AT91S_CAN {
	AT91_REG	 CAN_MR; 	/* Mode Register*/
	AT91_REG	 CAN_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 CAN_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 CAN_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 CAN_SR; 	/* Status Register*/
	AT91_REG	 CAN_BR; 	/* Baudrate Register*/
	AT91_REG	 CAN_TIM; 	/* Timer Register*/
	AT91_REG	 CAN_TIMESTP; 	/* Time Stamp Register*/
	AT91_REG	 CAN_ECR; 	/* Error Counter Register*/
	AT91_REG	 CAN_TCR; 	/* Transfer Command Register*/
	AT91_REG	 CAN_ACR; 	/* Abort Command Register*/
	AT91_REG	 Reserved0[52]; 	/* */
	AT91_REG	 CAN_VR; 	/* Version Register*/
	AT91_REG	 Reserved1[64]; 	/* */
	AT91S_CAN_MB	 CAN_MB0; 	/* CAN Mailbox 0*/
	AT91S_CAN_MB	 CAN_MB1; 	/* CAN Mailbox 1*/
	AT91S_CAN_MB	 CAN_MB2; 	/* CAN Mailbox 2*/
	AT91S_CAN_MB	 CAN_MB3; 	/* CAN Mailbox 3*/
	AT91S_CAN_MB	 CAN_MB4; 	/* CAN Mailbox 4*/
	AT91S_CAN_MB	 CAN_MB5; 	/* CAN Mailbox 5*/
	AT91S_CAN_MB	 CAN_MB6; 	/* CAN Mailbox 6*/
	AT91S_CAN_MB	 CAN_MB7; 	/* CAN Mailbox 7*/
	AT91S_CAN_MB	 CAN_MB8; 	/* CAN Mailbox 8*/
	AT91S_CAN_MB	 CAN_MB9; 	/* CAN Mailbox 9*/
	AT91S_CAN_MB	 CAN_MB10; 	/* CAN Mailbox 10*/
	AT91S_CAN_MB	 CAN_MB11; 	/* CAN Mailbox 11*/
	AT91S_CAN_MB	 CAN_MB12; 	/* CAN Mailbox 12*/
	AT91S_CAN_MB	 CAN_MB13; 	/* CAN Mailbox 13*/
	AT91S_CAN_MB	 CAN_MB14; 	/* CAN Mailbox 14*/
	AT91S_CAN_MB	 CAN_MB15; 	/* CAN Mailbox 15*/
} AT91S_CAN, *AT91PS_CAN;

/* -------- CAN_MR : (CAN Offset: 0x0) CAN Mode Register -------- */
#define AT91C_CAN_CANEN       ((unsigned int) 0x1 <<  0) /* (CAN) CAN Controller Enable*/
#define AT91C_CAN_LPM         ((unsigned int) 0x1 <<  1) /* (CAN) Disable/Enable Low Power Mode*/
#define AT91C_CAN_ABM         ((unsigned int) 0x1 <<  2) /* (CAN) Disable/Enable Autobaud/Listen Mode*/
#define AT91C_CAN_OVL         ((unsigned int) 0x1 <<  3) /* (CAN) Disable/Enable Overload Frame*/
#define AT91C_CAN_TEOF        ((unsigned int) 0x1 <<  4) /* (CAN) Time Stamp messages at each end of Frame*/
#define AT91C_CAN_TTM         ((unsigned int) 0x1 <<  5) /* (CAN) Disable/Enable Time Trigger Mode*/
#define AT91C_CAN_TIMFRZ      ((unsigned int) 0x1 <<  6) /* (CAN) Enable Timer Freeze*/
#define AT91C_CAN_DRPT        ((unsigned int) 0x1 <<  7) /* (CAN) Disable Repeat*/
/* -------- CAN_IER : (CAN Offset: 0x4) CAN Interrupt Enable Register -------- */
#define AT91C_CAN_MB0         ((unsigned int) 0x1 <<  0) /* (CAN) Mailbox 0 Flag*/
#define AT91C_CAN_MB1         ((unsigned int) 0x1 <<  1) /* (CAN) Mailbox 1 Flag*/
#define AT91C_CAN_MB2         ((unsigned int) 0x1 <<  2) /* (CAN) Mailbox 2 Flag*/
#define AT91C_CAN_MB3         ((unsigned int) 0x1 <<  3) /* (CAN) Mailbox 3 Flag*/
#define AT91C_CAN_MB4         ((unsigned int) 0x1 <<  4) /* (CAN) Mailbox 4 Flag*/
#define AT91C_CAN_MB5         ((unsigned int) 0x1 <<  5) /* (CAN) Mailbox 5 Flag*/
#define AT91C_CAN_MB6         ((unsigned int) 0x1 <<  6) /* (CAN) Mailbox 6 Flag*/
#define AT91C_CAN_MB7         ((unsigned int) 0x1 <<  7) /* (CAN) Mailbox 7 Flag*/
#define AT91C_CAN_MB8         ((unsigned int) 0x1 <<  8) /* (CAN) Mailbox 8 Flag*/
#define AT91C_CAN_MB9         ((unsigned int) 0x1 <<  9) /* (CAN) Mailbox 9 Flag*/
#define AT91C_CAN_MB10        ((unsigned int) 0x1 << 10) /* (CAN) Mailbox 10 Flag*/
#define AT91C_CAN_MB11        ((unsigned int) 0x1 << 11) /* (CAN) Mailbox 11 Flag*/
#define AT91C_CAN_MB12        ((unsigned int) 0x1 << 12) /* (CAN) Mailbox 12 Flag*/
#define AT91C_CAN_MB13        ((unsigned int) 0x1 << 13) /* (CAN) Mailbox 13 Flag*/
#define AT91C_CAN_MB14        ((unsigned int) 0x1 << 14) /* (CAN) Mailbox 14 Flag*/
#define AT91C_CAN_MB15        ((unsigned int) 0x1 << 15) /* (CAN) Mailbox 15 Flag*/
#define AT91C_CAN_ERRA        ((unsigned int) 0x1 << 16) /* (CAN) Error Active Mode Flag*/
#define AT91C_CAN_WARN        ((unsigned int) 0x1 << 17) /* (CAN) Warning Limit Flag*/
#define AT91C_CAN_ERRP        ((unsigned int) 0x1 << 18) /* (CAN) Error Passive Mode Flag*/
#define AT91C_CAN_BOFF        ((unsigned int) 0x1 << 19) /* (CAN) Bus Off Mode Flag*/
#define AT91C_CAN_SLEEP       ((unsigned int) 0x1 << 20) /* (CAN) Sleep Flag*/
#define AT91C_CAN_WAKEUP      ((unsigned int) 0x1 << 21) /* (CAN) Wakeup Flag*/
#define AT91C_CAN_TOVF        ((unsigned int) 0x1 << 22) /* (CAN) Timer Overflow Flag*/
#define AT91C_CAN_TSTP        ((unsigned int) 0x1 << 23) /* (CAN) Timestamp Flag*/
#define AT91C_CAN_CERR        ((unsigned int) 0x1 << 24) /* (CAN) CRC Error*/
#define AT91C_CAN_SERR        ((unsigned int) 0x1 << 25) /* (CAN) Stuffing Error*/
#define AT91C_CAN_AERR        ((unsigned int) 0x1 << 26) /* (CAN) Acknowledgment Error*/
#define AT91C_CAN_FERR        ((unsigned int) 0x1 << 27) /* (CAN) Form Error*/
#define AT91C_CAN_BERR        ((unsigned int) 0x1 << 28) /* (CAN) Bit Error*/
/* -------- CAN_IDR : (CAN Offset: 0x8) CAN Interrupt Disable Register -------- */
/* -------- CAN_IMR : (CAN Offset: 0xc) CAN Interrupt Mask Register -------- */
/* -------- CAN_SR : (CAN Offset: 0x10) CAN Status Register -------- */
#define AT91C_CAN_RBSY        ((unsigned int) 0x1 << 29) /* (CAN) Receiver Busy*/
#define AT91C_CAN_TBSY        ((unsigned int) 0x1 << 30) /* (CAN) Transmitter Busy*/
#define AT91C_CAN_OVLY        ((unsigned int) 0x1 << 31) /* (CAN) Overload Busy*/
/* -------- CAN_BR : (CAN Offset: 0x14) CAN Baudrate Register -------- */
#define AT91C_CAN_PHASE2      ((unsigned int) 0x7 <<  0) /* (CAN) Phase 2 segment*/
#define AT91C_CAN_PHASE1      ((unsigned int) 0x7 <<  4) /* (CAN) Phase 1 segment*/
#define AT91C_CAN_PROPAG      ((unsigned int) 0x7 <<  8) /* (CAN) Programmation time segment*/
#define AT91C_CAN_SYNC        ((unsigned int) 0x3 << 12) /* (CAN) Re-synchronization jump width segment*/
#define AT91C_CAN_BRP         ((unsigned int) 0x7F << 16) /* (CAN) Baudrate Prescaler*/
#define AT91C_CAN_SMP         ((unsigned int) 0x1 << 24) /* (CAN) Sampling mode*/
/* -------- CAN_TIM : (CAN Offset: 0x18) CAN Timer Register -------- */
#define AT91C_CAN_TIMER       ((unsigned int) 0xFFFF <<  0) /* (CAN) Timer field*/
/* -------- CAN_TIMESTP : (CAN Offset: 0x1c) CAN Timestamp Register -------- */
/* -------- CAN_ECR : (CAN Offset: 0x20) CAN Error Counter Register -------- */
#define AT91C_CAN_REC         ((unsigned int) 0xFF <<  0) /* (CAN) Receive Error Counter*/
#define AT91C_CAN_TEC         ((unsigned int) 0xFF << 16) /* (CAN) Transmit Error Counter*/
/* -------- CAN_TCR : (CAN Offset: 0x24) CAN Transfer Command Register -------- */
#define AT91C_CAN_TIMRST      ((unsigned int) 0x1 << 31) /* (CAN) Timer Reset Field*/
/* -------- CAN_ACR : (CAN Offset: 0x28) CAN Abort Command Register -------- */

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Ethernet MAC 10/100*/
/* ******************************************************************************/
typedef struct _AT91S_EMAC {
	AT91_REG	 EMAC_NCR; 	/* Network Control Register*/
	AT91_REG	 EMAC_NCFGR; 	/* Network Configuration Register*/
	AT91_REG	 EMAC_NSR; 	/* Network Status Register*/
	AT91_REG	 Reserved0[2]; 	/* */
	AT91_REG	 EMAC_TSR; 	/* Transmit Status Register*/
	AT91_REG	 EMAC_RBQP; 	/* Receive Buffer Queue Pointer*/
	AT91_REG	 EMAC_TBQP; 	/* Transmit Buffer Queue Pointer*/
	AT91_REG	 EMAC_RSR; 	/* Receive Status Register*/
	AT91_REG	 EMAC_ISR; 	/* Interrupt Status Register*/
	AT91_REG	 EMAC_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 EMAC_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 EMAC_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 EMAC_MAN; 	/* PHY Maintenance Register*/
	AT91_REG	 EMAC_PTR; 	/* Pause Time Register*/
	AT91_REG	 EMAC_PFR; 	/* Pause Frames received Register*/
	AT91_REG	 EMAC_FTO; 	/* Frames Transmitted OK Register*/
	AT91_REG	 EMAC_SCF; 	/* Single Collision Frame Register*/
	AT91_REG	 EMAC_MCF; 	/* Multiple Collision Frame Register*/
	AT91_REG	 EMAC_FRO; 	/* Frames Received OK Register*/
	AT91_REG	 EMAC_FCSE; 	/* Frame Check Sequence Error Register*/
	AT91_REG	 EMAC_ALE; 	/* Alignment Error Register*/
	AT91_REG	 EMAC_DTF; 	/* Deferred Transmission Frame Register*/
	AT91_REG	 EMAC_LCOL; 	/* Late Collision Register*/
	AT91_REG	 EMAC_ECOL; 	/* Excessive Collision Register*/
	AT91_REG	 EMAC_TUND; 	/* Transmit Underrun Error Register*/
	AT91_REG	 EMAC_CSE; 	/* Carrier Sense Error Register*/
	AT91_REG	 EMAC_RRE; 	/* Receive Ressource Error Register*/
	AT91_REG	 EMAC_ROV; 	/* Receive Overrun Errors Register*/
	AT91_REG	 EMAC_RSE; 	/* Receive Symbol Errors Register*/
	AT91_REG	 EMAC_ELE; 	/* Excessive Length Errors Register*/
	AT91_REG	 EMAC_RJA; 	/* Receive Jabbers Register*/
	AT91_REG	 EMAC_USF; 	/* Undersize Frames Register*/
	AT91_REG	 EMAC_STE; 	/* SQE Test Error Register*/
	AT91_REG	 EMAC_RLE; 	/* Receive Length Field Mismatch Register*/
	AT91_REG	 EMAC_TPF; 	/* Transmitted Pause Frames Register*/
	AT91_REG	 EMAC_HRB; 	/* Hash Address Bottom[31:0]*/
	AT91_REG	 EMAC_HRT; 	/* Hash Address Top[63:32]*/
	AT91_REG	 EMAC_SA1L; 	/* Specific Address 1 Bottom, First 4 bytes*/
	AT91_REG	 EMAC_SA1H; 	/* Specific Address 1 Top, Last 2 bytes*/
	AT91_REG	 EMAC_SA2L; 	/* Specific Address 2 Bottom, First 4 bytes*/
	AT91_REG	 EMAC_SA2H; 	/* Specific Address 2 Top, Last 2 bytes*/
	AT91_REG	 EMAC_SA3L; 	/* Specific Address 3 Bottom, First 4 bytes*/
	AT91_REG	 EMAC_SA3H; 	/* Specific Address 3 Top, Last 2 bytes*/
	AT91_REG	 EMAC_SA4L; 	/* Specific Address 4 Bottom, First 4 bytes*/
	AT91_REG	 EMAC_SA4H; 	/* Specific Address 4 Top, Last 2 bytes*/
	AT91_REG	 EMAC_TID; 	/* Type ID Checking Register*/
	AT91_REG	 EMAC_TPQ; 	/* Transmit Pause Quantum Register*/
	AT91_REG	 EMAC_USRIO; 	/* USER Input/Output Register*/
	AT91_REG	 EMAC_WOL; 	/* Wake On LAN Register*/
	AT91_REG	 Reserved1[13]; 	/* */
	AT91_REG	 EMAC_REV; 	/* Revision Register*/
} AT91S_EMAC, *AT91PS_EMAC;

/* -------- EMAC_NCR : (EMAC Offset: 0x0)  -------- */
#define AT91C_EMAC_LB         ((unsigned int) 0x1 <<  0) /* (EMAC) Loopback. Optional. When set, loopback signal is at high level.*/
#define AT91C_EMAC_LLB        ((unsigned int) 0x1 <<  1) /* (EMAC) Loopback local. */
#define AT91C_EMAC_RE         ((unsigned int) 0x1 <<  2) /* (EMAC) Receive enable. */
#define AT91C_EMAC_TE         ((unsigned int) 0x1 <<  3) /* (EMAC) Transmit enable. */
#define AT91C_EMAC_MPE        ((unsigned int) 0x1 <<  4) /* (EMAC) Management port enable. */
#define AT91C_EMAC_CLRSTAT    ((unsigned int) 0x1 <<  5) /* (EMAC) Clear statistics registers. */
#define AT91C_EMAC_INCSTAT    ((unsigned int) 0x1 <<  6) /* (EMAC) Increment statistics registers. */
#define AT91C_EMAC_WESTAT     ((unsigned int) 0x1 <<  7) /* (EMAC) Write enable for statistics registers. */
#define AT91C_EMAC_BP         ((unsigned int) 0x1 <<  8) /* (EMAC) Back pressure. */
#define AT91C_EMAC_TSTART     ((unsigned int) 0x1 <<  9) /* (EMAC) Start Transmission. */
#define AT91C_EMAC_THALT      ((unsigned int) 0x1 << 10) /* (EMAC) Transmission Halt. */
#define AT91C_EMAC_TPFR       ((unsigned int) 0x1 << 11) /* (EMAC) Transmit pause frame */
#define AT91C_EMAC_TZQ        ((unsigned int) 0x1 << 12) /* (EMAC) Transmit zero quantum pause frame*/
/* -------- EMAC_NCFGR : (EMAC Offset: 0x4) Network Configuration Register -------- */
#define AT91C_EMAC_SPD        ((unsigned int) 0x1 <<  0) /* (EMAC) Speed. */
#define AT91C_EMAC_FD         ((unsigned int) 0x1 <<  1) /* (EMAC) Full duplex. */
#define AT91C_EMAC_JFRAME     ((unsigned int) 0x1 <<  3) /* (EMAC) Jumbo Frames. */
#define AT91C_EMAC_CAF        ((unsigned int) 0x1 <<  4) /* (EMAC) Copy all frames. */
#define AT91C_EMAC_NBC        ((unsigned int) 0x1 <<  5) /* (EMAC) No broadcast. */
#define AT91C_EMAC_MTI        ((unsigned int) 0x1 <<  6) /* (EMAC) Multicast hash event enable*/
#define AT91C_EMAC_UNI        ((unsigned int) 0x1 <<  7) /* (EMAC) Unicast hash enable. */
#define AT91C_EMAC_BIG        ((unsigned int) 0x1 <<  8) /* (EMAC) Receive 1522 bytes. */
#define AT91C_EMAC_EAE        ((unsigned int) 0x1 <<  9) /* (EMAC) External address match enable. */
#define AT91C_EMAC_CLK        ((unsigned int) 0x3 << 10) /* (EMAC) */
#define 	AT91C_EMAC_CLK_HCLK_8               ((unsigned int) 0x0 << 10) /* (EMAC) HCLK divided by 8*/
#define 	AT91C_EMAC_CLK_HCLK_16              ((unsigned int) 0x1 << 10) /* (EMAC) HCLK divided by 16*/
#define 	AT91C_EMAC_CLK_HCLK_32              ((unsigned int) 0x2 << 10) /* (EMAC) HCLK divided by 32*/
#define 	AT91C_EMAC_CLK_HCLK_64              ((unsigned int) 0x3 << 10) /* (EMAC) HCLK divided by 64*/
#define AT91C_EMAC_RTY        ((unsigned int) 0x1 << 12) /* (EMAC) */
#define AT91C_EMAC_PAE        ((unsigned int) 0x1 << 13) /* (EMAC) */
#define AT91C_EMAC_RBOF       ((unsigned int) 0x3 << 14) /* (EMAC) */
#define 	AT91C_EMAC_RBOF_OFFSET_0             ((unsigned int) 0x0 << 14) /* (EMAC) no offset from start of receive buffer*/
#define 	AT91C_EMAC_RBOF_OFFSET_1             ((unsigned int) 0x1 << 14) /* (EMAC) one byte offset from start of receive buffer*/
#define 	AT91C_EMAC_RBOF_OFFSET_2             ((unsigned int) 0x2 << 14) /* (EMAC) two bytes offset from start of receive buffer*/
#define 	AT91C_EMAC_RBOF_OFFSET_3             ((unsigned int) 0x3 << 14) /* (EMAC) three bytes offset from start of receive buffer*/
#define AT91C_EMAC_RLCE       ((unsigned int) 0x1 << 16) /* (EMAC) Receive Length field Checking Enable*/
#define AT91C_EMAC_DRFCS      ((unsigned int) 0x1 << 17) /* (EMAC) Discard Receive FCS*/
#define AT91C_EMAC_EFRHD      ((unsigned int) 0x1 << 18) /* (EMAC) */
#define AT91C_EMAC_IRXFCS     ((unsigned int) 0x1 << 19) /* (EMAC) Ignore RX FCS*/
/* -------- EMAC_NSR : (EMAC Offset: 0x8) Network Status Register -------- */
#define AT91C_EMAC_LINKR      ((unsigned int) 0x1 <<  0) /* (EMAC) */
#define AT91C_EMAC_MDIO       ((unsigned int) 0x1 <<  1) /* (EMAC) */
#define AT91C_EMAC_IDLE       ((unsigned int) 0x1 <<  2) /* (EMAC) */
/* -------- EMAC_TSR : (EMAC Offset: 0x14) Transmit Status Register -------- */
#define AT91C_EMAC_UBR        ((unsigned int) 0x1 <<  0) /* (EMAC) */
#define AT91C_EMAC_COL        ((unsigned int) 0x1 <<  1) /* (EMAC) */
#define AT91C_EMAC_RLES       ((unsigned int) 0x1 <<  2) /* (EMAC) */
#define AT91C_EMAC_TGO        ((unsigned int) 0x1 <<  3) /* (EMAC) Transmit Go*/
#define AT91C_EMAC_BEX        ((unsigned int) 0x1 <<  4) /* (EMAC) Buffers exhausted mid frame*/
#define AT91C_EMAC_COMP       ((unsigned int) 0x1 <<  5) /* (EMAC) */
#define AT91C_EMAC_UND        ((unsigned int) 0x1 <<  6) /* (EMAC) */
/* -------- EMAC_RSR : (EMAC Offset: 0x20) Receive Status Register -------- */
#define AT91C_EMAC_BNA        ((unsigned int) 0x1 <<  0) /* (EMAC) */
#define AT91C_EMAC_REC        ((unsigned int) 0x1 <<  1) /* (EMAC) */
#define AT91C_EMAC_OVR        ((unsigned int) 0x1 <<  2) /* (EMAC) */
/* -------- EMAC_ISR : (EMAC Offset: 0x24) Interrupt Status Register -------- */
#define AT91C_EMAC_MFD        ((unsigned int) 0x1 <<  0) /* (EMAC) */
#define AT91C_EMAC_RCOMP      ((unsigned int) 0x1 <<  1) /* (EMAC) */
#define AT91C_EMAC_RXUBR      ((unsigned int) 0x1 <<  2) /* (EMAC) */
#define AT91C_EMAC_TXUBR      ((unsigned int) 0x1 <<  3) /* (EMAC) */
#define AT91C_EMAC_TUNDR      ((unsigned int) 0x1 <<  4) /* (EMAC) */
#define AT91C_EMAC_RLEX       ((unsigned int) 0x1 <<  5) /* (EMAC) */
#define AT91C_EMAC_TXERR      ((unsigned int) 0x1 <<  6) /* (EMAC) */
#define AT91C_EMAC_TCOMP      ((unsigned int) 0x1 <<  7) /* (EMAC) */
#define AT91C_EMAC_LINK       ((unsigned int) 0x1 <<  9) /* (EMAC) */
#define AT91C_EMAC_ROVR       ((unsigned int) 0x1 << 10) /* (EMAC) */
#define AT91C_EMAC_HRESP      ((unsigned int) 0x1 << 11) /* (EMAC) */
#define AT91C_EMAC_PFRE       ((unsigned int) 0x1 << 12) /* (EMAC) */
#define AT91C_EMAC_PTZ        ((unsigned int) 0x1 << 13) /* (EMAC) */
/* -------- EMAC_IER : (EMAC Offset: 0x28) Interrupt Enable Register -------- */
/* -------- EMAC_IDR : (EMAC Offset: 0x2c) Interrupt Disable Register -------- */
/* -------- EMAC_IMR : (EMAC Offset: 0x30) Interrupt Mask Register -------- */
/* -------- EMAC_MAN : (EMAC Offset: 0x34) PHY Maintenance Register -------- */
#define AT91C_EMAC_DATA       ((unsigned int) 0xFFFF <<  0) /* (EMAC) */
#define AT91C_EMAC_CODE       ((unsigned int) 0x3 << 16) /* (EMAC) */
#define AT91C_EMAC_REGA       ((unsigned int) 0x1F << 18) /* (EMAC) */
#define AT91C_EMAC_PHYA       ((unsigned int) 0x1F << 23) /* (EMAC) */
#define AT91C_EMAC_RW         ((unsigned int) 0x3 << 28) /* (EMAC) */
#define AT91C_EMAC_SOF        ((unsigned int) 0x3 << 30) /* (EMAC) */
/* -------- EMAC_USRIO : (EMAC Offset: 0xc0) USER Input Output Register -------- */
#define AT91C_EMAC_RMII       ((unsigned int) 0x1 <<  0) /* (EMAC) Reduce MII*/
#define AT91C_EMAC_CLKEN      ((unsigned int) 0x1 <<  1) /* (EMAC) Clock Enable*/
/* -------- EMAC_WOL : (EMAC Offset: 0xc4) Wake On LAN Register -------- */
#define AT91C_EMAC_IP         ((unsigned int) 0xFFFF <<  0) /* (EMAC) ARP request IP address*/
#define AT91C_EMAC_MAG        ((unsigned int) 0x1 << 16) /* (EMAC) Magic packet event enable*/
#define AT91C_EMAC_ARP        ((unsigned int) 0x1 << 17) /* (EMAC) ARP request event enable*/
#define AT91C_EMAC_SA1        ((unsigned int) 0x1 << 18) /* (EMAC) Specific address register 1 event enable*/
/* -------- EMAC_REV : (EMAC Offset: 0xfc) Revision Register -------- */
#define AT91C_EMAC_REVREF     ((unsigned int) 0xFFFF <<  0) /* (EMAC) */
#define AT91C_EMAC_PARTREF    ((unsigned int) 0xFFFF << 16) /* (EMAC) */

